// Додаткове завдання. У разі реалізації даного функціоналу на backendі, при першому завантаженні сторінки слід робити запит на backend за статистичною інформацією застосунку та зберігати її у redux store.

// StatisticsInfo містить інформацію про:
//  - кількість відео-тренувань у застосунку
//  - загальну кількість спалених користувачами калорій
//  - загальну кількість зареєстрованих у застосунку користувачів
//  - загальну кількість годин, проведених користувачами за тренуванням
//  - загальну кількість тренувань, виконаних користувачами

// Якщо даний функціонал не реалізовано - відобразити статичну інформацію, наведену на макеті

function StatisticsInfo() {
  return <div></div>;
}

export default StatisticsInfo;
