// ProductsFilters містить в собі:
//  - поле для пошуку продуктів по вмісту ключового слова в назві. Якщо поле для пошуку заповнене - поряд з іконкою лупи повинна зʼявлятись кнопка з іконкою хрестика, по clickу на яку поле для пошуку має бути очищене. Пошук продуктів відбувається по події submit або  clickу на іконку лупи
//  - поле з випадаючим списком категорій продуктів. Пошук продуктів відбувається при виборі категорії
//  - поле з випадаючим списком типів продуктів. Пошук продуктів відбувається при виборі типу

// Запит на backend має відправлятися з урахуванням усіх параметрів пошуку.

function ProductsFilters() {
  return <div></div>;
}

export default ProductsFilters;
