// DayProducts містить в собі:
//  - підзаголовок
//  - посилання Add product, що переадресовує користувача на Products page
//  - компонент ProductsTable, що містить інформацію про перелік продуктів, спожитих користувачем за обрану ним дату

// По clickу на іконку-"смітник" має відправлятись запит на backend щодо видалення відповідного продукту по його ID.
// Якщо backend повернув помилку - необхідно її опрацювати і відобразити користувачеві у вигляді вспливаючого віконечка-notification. Якщо запит на backend пройшов успішно - дані слід актуалізувати.

function DayProducts() {
  return <div></div>;
}

export default DayProducts;
