// DayExercises містить в собі:
//  - підзаголовок
//  - посилання Add exercise, що переадресовує користувача на Exercises page
//  - компонент ExercisesTable, що містить інформацію про перелік вправ, виконаних користувачем за обрану ним дату

// По clickу на іконку-"смітник" має відправлятись запит на backend щодо видалення відповідної вправи по його ID.
// Якщо backend повернув помилку - необхідно її опрацювати і відобразити користувачеві у вигляді вспливаючого віконечка-notification. Якщо запит на backend пройшов успішно - дані слід актуалізувати.

function DayExercises() {
  return <div></div>;
}

export default DayExercises;
