// Компонент відображає обрану користувачем дату у форматі dd/mm/YYYY.  По замовчуванню обрана дата дорівнює поточній даті.

// По clickу на поточну дату має відкриватись календар для зручного вибору дати користувачем.

// По clickу на іконку-"<" поточна дата має змінюватись на дату попереднього дня.
// По clickу на іконку-">" поточна дата має змінюватись на дату наступного дня.

// Дати, що передували даті реєстрації авторизованого користувача, мають бути недоступними для вибору.

function DaySwitch() {
  return <div></div>;
}

export default DaySwitch;
