// AddExerciseForm містить:
//  - gif-зображення, що відображає, як слід виконувати обрану користувачем вправу
//  - назву вправи
//  - інформацію про мʼязи, які буде вдосконалено в результаті виконання вправи
//  - інформацію про частину тіла, яка буде задіяна під час виконання вправи
//  - інформацію про обладнання, яке слід використовувати під час виконання вправи
//  - таймер, що веде відлік часу, за який виконується вправа користувачем, з можливістю його призупинення та продовження
//  - кількість спалених калорій, що динамічно розраховується та відображається в залежності від часу виконання користувачем вправи за формулою

// Х = (час виконання користувачем вправи(в хвилинах) * кількість калорій, що спалюється за 3min) / 3min

// exercise(exercise ID) - string; required
// date - string; format dd/mm/YYYY; required
// time - number; minimum 1(min); required
// calories - number; minimum 1; required

// Кнопка Add to diary(типу "submit") - відправляє запит на backend для додавання виконаної користувачем вправи за день та закриває BasicModalWindow з AddExerciseForm.

// Якщо backend повернув помилку - необхідно її опрацювати і відобразити користувачеві у вигляді вспливаючого віконечка-notification.
// Якщо запит на backend пройшов успішно - BasicModalWindow з AddExerciseSuccess має бути відкрито.

function AddExerciseForm() {
  return <div></div>;
}

export default AddExerciseForm;
